Revit API Introduction Labs
Lab3_5_WallAndFloorTypes Class
 Access and modify system family type, similarly to the standard families looked at above: List all wall and floor types and change the type of selected walls and floors.
 In this section, we list system types and change the type of a system family instance element. All the previous labs in this section dealt with the standard families and instances. In this lab, we show more or less the same issues for system families, which are often host objects, such as walls and floors. Wall is the most comprehensively exposed host object so far in the Revit API. Specific and dedicated classes, methods and properties are available which makes them somewhat simpler to use than standard family instances.
 Add a new command class to the Lab3 module, e.g. Lab3_5_WallAndFloorTypes. First we will enumerate all available wall types. This is simple thanks to the dedicated property on the document object. We will also store the last one in order to change the selected wall's type later without any complex user interface:
 Implement the same functionality for floor types. Since Revit 2008, the document class has a FloorTypes property and we can use this to retrieve the collection of all the floor types. However from 9.0 version, the "Foundation Slab" system family from the "Structural Foundations" category also contain FloorType class instances.
 In the C# sample, we loop through all the FloorTypes listed in the document and then check if the category of the floor type is same as built-in category of Floor. This is done by comparing the category id of the floor type element with that of the built-in Floors category. Please note that from Revit 2009 onwards, category ids need to be used to compare categories, instead of comparing categories with each other directly.
 In the VB.Net sample, the approach is more performance centric, where we use a compound filter called NewLogicAndFilter and use that to filter elements of FloorType AND built-in category Floors to avoid structural foundation floor slabs.
 Modifying the wall and floor type of an instance are simple nowaday, since the WallType and FloorType properties are availablke, respectively.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public class Lab3_5_WallAndFloorTypes : IExternalCommand
Visual Basic (Declaration)
Public Class Lab3_5_WallAndFloorTypes _
	Implements IExternalCommand
Visual C++
public ref class Lab3_5_WallAndFloorTypes : IExternalCommand
Inheritance Hierarchy
System.Object
 Labs.Lab3_5_WallAndFloorTypes
See Also
Lab3_5_WallAndFloorTypes Members
Labs Namespace